Repository: itprojects/MasVisGtk
Catalog: po/*.po
Languages: bg_bg, es_es, pt_br

source: {} [{}, {} channels, {} bits, {:0.1f} kHz, {} kbps]
bg_bg: {} [{}, {} канал/а, {} бита, {:0.1f} кХц, {} кб/сек]
es_es: {} [{}, {} canales, {} bits, {:0.1f} kHz, {} kbps]
pt_br: {} [{}, {} canais, {} bits, {:0.1f} kHz, {} kbps]

source: Overview
bg_bg: Прегледен Разадел
es_es: Resumen
pt_br: Resumo

source: Mono
bg_bg: Моно

source: Left
bg_bg: Ляв
es_es: Izquierda
pt_br: Esquerda

source: Right
bg_bg: Десен
es_es: Derecha
pt_br: Direito

source: Downmix Left
bg_bg: Смеси към Ляв
es_es: Downmix izquierda
pt_br: Downmix Esquerda

source: Downmix Right
bg_bg: Смеси към Десен
es_es: Downmix a la derecha
pt_br: Downmix Direito

source: Front Left
bg_bg: Преден Ляв
es_es: Delantero a la izquierda
pt_br: Frente Esquerda

source: Front Right
bg_bg: Преден Десен
es_es: Delantero a la derecha
pt_br: Frente Direito

source: Low Frequency
bg_bg: Ниско Честотен
es_es: Baja frecuencia
pt_br: Gráfico de frequência

source: Front Center
bg_bg: Преден Среден
es_es: Centro delantero
pt_br: Centro da frente

source: Back Center
bg_bg: Заден Среден
es_es: Centro trasero
pt_br: Centro traseiro

source: Back Left
bg_bg: Заден Ляв
es_es: De vuelta a la izquierda
pt_br: Voltar Esquerdo

source: Back Right
bg_bg: Заден Десен
es_es: De vuelta a la derecha
pt_br: Voltar à direita

source: Side Left
bg_bg: Страничен Ляв
es_es: Lado a la izquierda
pt_br: Lado esquerdo

source: Side Right
bg_bg: Страничен Десен
es_es: Lado a la derecha
pt_br: Lado direito

source: Front Left-of-Center
bg_bg: Преден Ляв-от-Средата
es_es: Delantero izquierdo de centro
pt_br: Frente Esquerda do Centro

source: Front Right-of-Center
bg_bg: Преден Десен-от-Средата
es_es: Derecho de centro delantero
pt_br: Frente Direita do Centro

source: Top Front Left
bg_bg: Горен Преден Ляв
es_es: Superior delantera izquierda
pt_br: Frente superior esquerda

source: Top Front Right
bg_bg: Горен Преден Десен
es_es: Superior delantero a la derecha
pt_br: Superior Frontal Direito

source: Top Back Left
bg_bg: Горен Заден Ляв
es_es: Arriba a la izquierda
pt_br: Topo Traseiro Esquerdo

source: Top Back Right
bg_bg: Горен Заден Десен
es_es: Cubra a la derecha
pt_br: Topo Traseiro Direito

source: Top Front Center
bg_bg: Горен Преден Среден
es_es: Centro delantero superior
pt_br: Centro Frontal Superior

source: Top Back Center
bg_bg: Горен Заден Среден
es_es: Centro Trasero Superior
pt_br: Centro Traseiro Superior

source: Wide Left
bg_bg: Широк Ляв
es_es: A la izquierda
pt_br: Esquerda Ampla

source: Wide Right
bg_bg: Широк Десен
es_es: Amplio a la derecha
pt_br: Direita Ampla

source: Top Center
bg_bg: Горен Среден
es_es: Centro superior
pt_br: Centro Superior

source: Low Frequency 2
bg_bg: Ниско Честотен 2
es_es: Baja frecuencia 2
pt_br: Baixa frequência 2

source: Top Side Left
bg_bg: Горен Страничен Ляв
pt_br: Lado superior esquerdo

source: Top Side Right
bg_bg: Горен Страничен Десен
es_es: Top del lado a la derecha
pt_br: Lado superior direito

source: Bottom Front Center
bg_bg: Долен Преден Среден
es_es: Centro delantero inferior
pt_br: Centro frontal inferior

source: Bottom Front Left
bg_bg: Долен Преден Ляв
es_es: Parte inferior delantera izquierda
pt_br: Inferior Frontal Esquerdo

source: Bottom Front Right
bg_bg: Долен Преден Десен
es_es: Parte inferior delantera derecha
pt_br: Inferior Frontal Direito

source: Animation duration in milliseconds.
bg_bg: Анимационна продължителност в милисекунди.
es_es: Duración de animación en milisegundos.

source: Animate Tabs
bg_bg: Анимирай Раздели
es_es: Pestañas animadas

source: Set animation duration [ms]
bg_bg: Анимационна продължителност [милисек]
es_es: Establecer la duración de la animación [MS]

source: Save Animation
bg_bg: Запази Анимацията
es_es: Guardar animación

source: Cannot Animate
bg_bg: Не може да се анимира
es_es: No se puede animar

source: Animate
bg_bg: Анимирай
es_es: Animar

source: Animate tabs in separate window
bg_bg: Анимирай разделите в отделен прозорец
es_es: Pestañas animadas en una ventana separada

source: Animate ALL tabs in separate window
bg_bg: Анимирай ВСИЧКИТЕ раздели в отделен прозорец
es_es: Animar TODAS las pestañas en una ventana separada

source: Animation #
bg_bg: Анимация #
es_es: Animación #

source: Save tabs to animated gif image
bg_bg: Запази разделите в анимирана гиф снимка
es_es: Guardar pestañas a la imagen animada de gif

source: Processing images.
bg_bg: Обработване на снимки.
es_es: Procesamiento de imágenes.

source: Animated image ready for saving.
bg_bg: Анимирай снимка преди записване.
es_es: Imagen animada lista para guardar.

source: Animation Error
bg_bg: Анимационна Грешка
es_es: Error de animación

source: Cannot create animation. Plotting canvas cannot be made into image.
bg_bg: Не може да се сътвори анимацията. Платното на чертежът не може да се направи на снимка.
es_es: No se puede crear animación. El trazado de lienzos no se puede convertir en una imagen.

source: Reset original view
bg_bg: Възстанови първоначалният изглед
es_es: Restablecer la vista original

source: Back to previous view
bg_bg: Обратно към предишния изглед
es_es: Volver a la vista anterior

source: Forward to next view
bg_bg: Напред към следващия изглед
es_es: Avance a la siguiente vista

source: Left button pans, Right button zooms x/y fixes axis, CTRL fixes aspect
bg_bg: Ляво копче премества, дясно копче увеличава, х/у ще поправя осите, КОНТРОЛ ще поправя аспекта
es_es: Sartenes del botón izquierdo, zooms del botón derecho x/y Corrección del eje, aspecto de correcciones CTRL

source: Zoom to rectangle x/y fixes axis
bg_bg: Увеличи до правоъгълник, х/у ще поправя осите
es_es: Zoom al rectángulo eje fijo x/y

source: Save the figure
bg_bg: Запази фигурата
es_es: Guardar la figura

source: Zoom Level [px]
bg_bg: Ниво на Увеличение [пиксели]
es_es: Nivel de zoom [PX]

source: Resotre original dimensions
bg_bg: Възстанови първоначалните размери
es_es: Restaurar dimensiones originales
