Repository: itprojects/MasVisGtk
Catalog: po/*.po
Languages: bg_bg, es_es, pt_br

source: MasVisGtk
bg_bg: МасВисГтк

source: Audio analysis
bg_bg: Звуков анализ
es_es: Análisis de audio
pt_br: Análise de áudio

source: Audio analysis tool for your music
bg_bg: Звуко-анализиращ прибор за вашата музика
es_es: Herramienta de análisis de audio para su música
pt_br: Ferramenta de análise de áudio para sua música

source: Audio;Loudness;Analysis;Music;Media;
bg_bg: Звук;Шумност;Анализ;Музика;Медия;
es_es: Audio; Volumen; Análisis; Música; Medios;
pt_br: Áudio; volume; análise; música; mídia;

source: Detect audio mastering defects. Based on pymasvis app/module, using numpy, scipy, pyplot (matplotlib).
bg_bg: Засечете звукови дефекти във файлове. Основано на ПайМасВис приложението/модул, ползвайки нъмпи, сайпи, пайплот (матплотлиб).
es_es: Detectar defectos de maestría de audio. Basado en la aplicación/módulo de PymaSvis, usando Numpy, Scipy, Pyplot (matplotlib).
pt_br: Detectar defeitos de masterização de áudio. Baseado no aplicativo/módulo pymasvis, utilizando numpy, scipy, pyplot (matplotlib).

source: Waveform plotting
bg_bg: Изобразяване на звукови вълни
es_es: Trazado de forma de onda
pt_br: Plotagem da forma de onda

source: Overview of files (by-folder support)
bg_bg: Преглед на файлове (по-папкова поддръжка)
es_es: Descripción general de los archivos (soporte por parte de la persona)
pt_br: Visão geral dos arquivos (suporte mais dobrador)

source: Frequency plot
bg_bg: Изобразяване на звукови честоти
es_es: Gráfico de frecuencia
pt_br: Gráfico de frequência

source: Dynamic Range estimation
bg_bg: Изчисление на звуков обхват
es_es: Estimación de rango dinámico
pt_br: Estimativa de faixa dinâmica

source: Peak estimation
bg_bg: Изчисление на връх
es_es: Estimación máxima
pt_br: Estimativa de pico

source: Crest Factor estimation
bg_bg: Изчисление на вълнови параметри
es_es: Estimación del factor de cresta
pt_br: Estimativa do fator de crista

source: Histogram plot
bg_bg: Изобразяване на хистограма
es_es: Gráfico de histograma
pt_br: Lote de histograma

source: Peak vs. RMS plot
bg_bg: Изобразяване на Връх срещу RMS
es_es: Peak vs. RMS Parcela
pt_br: Phota de pico vs. rms

source: Loudness analysis, EBU R128 plot
bg_bg: Анализ на звукови нива, EBU R128 чертеж
es_es: Análisis de volumen, trama EBU R128
pt_br: Análise de sonoridade, plotagem EBU R128

source: Multi-channel audio support
bg_bg: Многоканална звукова поддръжка
es_es: Soporte de audio multicanal
pt_br: Suporte de áudio multicanal

source: Language of the application.
bg_bg: Език на приложението.
es_es: Lenguaje de la aplicación.
pt_br: Idioma do aplicativo.

source: The language of the application, if the translation exists.
bg_bg: Езикът на приложението, ако преводът съществува.
es_es: El idioma de la aplicación, si la traducción existe.
pt_br: O idioma do aplicativo, se a tradução existir.

source: Application style.
bg_bg: Външният вид на приложението.
es_es: Estilo de aplicación.
pt_br: Estilo de aplicativo.

source: Application style, follow system 0, light 1, dark 2.
bg_bg: Външният вид на приложението, следва системата 0, светъл 1, тъмен 2.
es_es: Estilo de aplicación, seguir sistema 0, claro 1, oscuro 2.
pt_br: Estilo de aplicação, siga o sistema 0, luz 1, escuro 2.

source: Matplotlib style.
bg_bg: Външният вид на Матплотлиб.
es_es: Estilo matplotlib.
pt_br: Estilo matplotlib.

source: Matplotlib visual style. 'Solarize_Light2', 'bmh', 'classic', 'dark_background', 'fast', 'fivethirtyeight', 'ggplot', 'grayscale'
bg_bg: Външният вид на МАтплотлиб. 'Solarize_Light2', 'bmh', 'classic', 'dark_background', 'fast', 'fivethirtyeight', 'ggplot', 'grayscale'
es_es: Matplotlib estilo visual. 'Solarize_light2', 'BMH', 'Classic', 'Dark_Background', 'Fast', 'FivethirtyEight', 'GGPlot', 'Grayscale'
pt_br: Estilo visual de matplotlib. 'Solarize_light2', 'BMH', 'Classic', 'Dark_background', 'Fast', 'FivethirtyEight', 'GGPlot', 'GrayScale'

source: Custom font.
bg_bg: Персонализиран фонт.
es_es: Fuente personalizada.
pt_br: Fonte personalizada.

source: Custom font preferences, using the font button.
bg_bg: Предпочитание за персонализиран фонт, използвайки фонтовия бутон.
es_es: Preferencias de fuente personalizadas, usando el botón de fuente.
pt_br: Preferências de fonte personalizadas, usando o botão Fonte.

source: Save format.
bg_bg: Формат за запазване.
es_es: Guardar formato.
pt_br: Salvar formato.

source: Open other files.
bg_bg: Отвори други файлове.
es_es: Abra otros archivos.
pt_br: Abra outros arquivos.

source: Allows opeing non-audio file types, like videos. App can crash more often. Needs lots of free RAM.
bg_bg: Allows opeing non-audio file types, like videos. App can crash more often. Позволява отваряне на не-звукови файлове, като видеа. Приложението може са се срива по-често. Нуздае се от доста свободна виртуална памет.
es_es: Permite abrir tipos de archivos que no son de audio, como videos. La aplicación puede bloquearse con más frecuencia. Necesita mucha RAM gratis.
pt_br: Permite que os tipos de arquivos que não são de audiote, como vídeos. O aplicativo pode travar com mais frequência. Precisa de muita RAM gratuita.

source: DPI for plots.
bg_bg: DPI за чертежи.
es_es: DPI para tramas.
pt_br: DPI para parcelas.

source: DPI for saved images.
bg_bg: DPI за запазени изображения.
es_es: DPI para imágenes guardadas.
pt_br: DPI para imagens salvas.

source: One audio plot width in comparison window.
bg_bg: Единична чертежна дължина в прозореца за сравнение.
es_es: Un ancho de la trama de audio en la ventana de comparación.
pt_br: Uma largura da trama de áudio na janela de comparação.

source: Window Actions
bg_bg: Действия в Прозореца
es_es: Acciones de ventana
pt_br: Ações da janela

source: Help Manual
bg_bg: Помощен Наръчник
es_es: Ayuda Manual
pt_br: Manual de ajuda

source: Open Menu
bg_bg: Отвори Меню
es_es: Menú abierto
pt_br: Abrir menu

source: Fullscreen/Unfullscreen
bg_bg: На Цял Екран/Не На Цял Екран
es_es: Pantalla completa/pantalla completa
pt_br: Tela completa/não prejudicial

source: Unfullscreen
bg_bg: Не На Цял Екран
es_es: Pantalla completa
pt_br: Crega não prejudicial

source: Shortcuts
bg_bg: Клавишни Комбинации
es_es: Atajos
pt_br: Atalhos

source: Quit
bg_bg: Изключи
es_es: Abandonar
pt_br: Desistir

source: File Actions
bg_bg: Файлови Действия
es_es: Acciones de archivo
pt_br: Ações de arquivo

source: Show File Information
bg_bg: Покажи Файлово Сведение
es_es: Mostrar información del archivo
pt_br: Mostre informações do arquivo

source: Simple File(s) Open
bg_bg: Просто отваряне на Файл(ове)
es_es: Archivo simple (IS) Abierto
pt_br: Arquivos simples abertos

source: Advance Open / Overview
bg_bg: Разширено отваряне / Преглед
es_es: Avanzar Abrir / Descripción general
pt_br: Avanço do Aberto / Visão Geral

source: Tab Actions
bg_bg: Разделови Действия
es_es: Acciones de pestaña
pt_br: Ações da guia

source: Compare Tabs
bg_bg: Сравни Раздели
es_es: Comparar pestañas
pt_br: Compare guias

source: Save Current Tab
bg_bg: Запази Видимия Раздел
es_es: Guardar pestaña actual
pt_br: Salvar a guia atual

source: Save All Tabs
bg_bg: Запази Всички Раздели
es_es: Guardar todas las pestañas
pt_br: Salve todas as guias

source: Understanding Graphs
bg_bg: Представа за Чертежите
es_es: Entendiendo gráficos
pt_br: Entendendo os gráficos

source: Language
bg_bg: Език
es_es: Idioma
pt_br: Linguagem

source: Language and locale
bg_bg: Език и Обстоятелства
es_es: Idioma y localidad
pt_br: Idioma e localidade

source: Theme and Style
bg_bg: Външен Вид
es_es: Tema y estilo
pt_br: Tema e estilo

source: Application style
bg_bg: Външният вид на приложението
es_es: Estilo de aplicación
pt_br: Estilo de aplicativo

source: Matplotlib built-in style
bg_bg: Вграден външният вид на Матплотлиб
es_es: Matplotlib estilo incorporado
pt_br: Estilo interno de matplotlib

source: Matplotlib custom background
bg_bg: Персонализиран чертежен фон на Матплотлиб
es_es: Matplotlib Fondo personalizado
pt_br: Fundo personalizado de matplotlib

source: Matplotlib custom font
bg_bg: Персонализиран чертежен фонт на Матплотлиб
es_es: Matplotlib Fuente personalizada
pt_br: Fonte personalizada de matplotlib

source: Files
bg_bg: Файлове
es_es: Archivos
pt_br: Arquivos

source: Default saved image format
bg_bg: Формат за запазване, по подразбиране
es_es: Formato de imagen guardado predeterminado
pt_br: Formato de imagem salva padrão padrão

source: Open other (video) files. Needs more free RAM.
bg_bg: Отваряй други (видео) файлове. Нуждае се от повече РАМ памет.
es_es: Abra otros archivos (video). Necesita más RAM gratis.
pt_br: Abra outros arquivos (de vídeo). Precisa de mais RAM gratuita.

source: Visual Quality
bg_bg: Качество на Изображенито
es_es: Calidad visual
pt_br: Qualidade visual

source: DPI of plots
bg_bg: DPI за чертежи в приложението
es_es: DPI de tramas
pt_br: DPI de parcelas

source: DPI of saved files
bg_bg: DPI за запазени фаилове
es_es: DPI de archivos guardados
pt_br: DPI de arquivos salvos

source: One audio plot width in comparison window
bg_bg: Единична чертежна дължина в прозореца за сравнение
es_es: Un ancho de trama de audio en la ventana de comparación
pt_br: Uma largura da trama de áudio na janela de comparação

source: Cannot set locale
bg_bg: Не може да се приложи език
es_es: No se puede establecer un local
pt_br: Não é possível definir localidade

source: FILES/FOLDERS
bg_bg: ФАЙЛОВЕ/ПАПКИ
es_es: Archivos/carpetas
pt_br: Arquivos/pastas

source: FILE(S) and/or FOLDER(S) paths to process inside the application MasVisGtk is an audio file analysis application.
bg_bg: ФАИЛ(ОВЕ) и/или ПАПКОВИ местоположения за обработка в приложението МасВисГтк е приложение за звуков анализ.
es_es: Archivo (s) y/o rutas de carpetas para procesar dentro de la aplicación MASVISGTK es una aplicación de análisis de archivos de audio.
pt_br: Arquivos e/ou caminhos (s) de pastas para processar dentro do aplicativo Masvisgtk é um aplicativo de análise de arquivo de áudio.

source: The original python module is also available with this package. The command line options are different from the original. Large file are always slow to render.
bg_bg: Първоначалният питонов модул е също така достъпен с това приложение. Командите са различни от първоначалния. Големите файлове винаги са бавни за изобразяване.
es_es: El módulo Python original también está disponible con este paquete. Las opciones de línea de comando son diferentes de la original. El archivo grande siempre es lento para renderizar.
pt_br: O módulo Python original também está disponível com este pacote. As opções da linha de comando são diferentes do original. Arquivo grande é sempre lento para renderizar.

source: Version of MasVisGtk.
bg_bg: Версия на МасВисГтк.
es_es: Versión de Mavis GTK.
pt_br: Versão do Masvisgtk.

source: Show Verbose Messages.
bg_bg: Покажи Mногословените Надписи.
es_es: Mostrar mensajes detallados.
pt_br: Mostre mensagens detalhadas.

source: Show Debug Messages.
bg_bg: Покажи Mногословените Надписи.
es_es: Mostrar mensajes de depuración.
pt_br: Mostre mensagens de depuração.

source: Show Supported Formats.
bg_bg: Няма Поддържани Формати.
es_es: Mostrar formatos compatibles.
pt_br: Mostrar formatos suportados.

source: Use [LU], instead of [LUFS], when displaying R128 values, (default: LUFS).
bg_bg: Ползвай [LU] единици, вместо [LUFS], когато показваш R128 стойности, (по подразбиране: LUFS).
pt_br: Use [Lu], em vez de [LUFs], ao exibir valores R128, (padrão: LUFS).

source: flat, generate one overview tab for all, or dir, for one tab for folders, (default: flat).
bg_bg: flat, създай един прегледен раздел за всички, или dir, един раздел на папка, (по подразбиране: dir).
es_es: Flat, genere una pestaña Descripción general para todos, o dir, para una pestaña para carpetas, (predeterminado: plano).
pt_br: Plano, Gere uma guia Visão geral para todos, ou dir, para uma guia para pastas (padrão: plana).

source: If input is a folder, process subfolders, too.
bg_bg: Ако входните данни са папка, обработи и под-папките, също.
es_es: Si la entrada es una carpeta, también procese subcarpetas.
pt_br: Se a entrada for uma pasta, também o processo subpasta.

source: FILE(S) or FOLDER(S)
bg_bg: ФАЙЛ(ОВЕ) или ПАПКИ
es_es: Archivos) o carpetas)
pt_br: Arquivos ou pastas (s)

source: MasVisGtk Version
bg_bg: МасВисГтк Версия
es_es: Versión MasVisGtk
pt_br: Versão Masvisgtk

source: Supported Formats:
bg_bg: Поддържани Формати:
es_es: Formatos compatibles:
pt_br: Formatos suportados:

source: is not possible with option -o. Try dir or flat.
bg_bg: не е възможен с -o. Пробвайте dir или flat.
es_es: No es posible con la opción -o. Intenta con dir o flat.
pt_br: não é possível com a opção -O. Experimente Dir ou plano.

source: No input files or folders supplied.
bg_bg: Няма входни файлове или папки.
es_es: No se suministran archivos o carpetas de entrada.
pt_br: Nenhum arquivo de entrada ou pastas fornecidas.

source: Bad permisions for file.
bg_bg: Неприемливи разрешения за файл.
es_es: Malos permisos para el archivo.
pt_br: Permissões ruins para arquivo.

source: Bad input:
bg_bg: Лоши входни данни:
es_es: Mala entrada:
pt_br: Entrada ruim:

source: Error processing files:
bg_bg: Грешка при отваряне:
es_es: Archivos de procesamiento de errores:
pt_br: Erro de processamento de arquivos:

source: Bad input files:
bg_bg: Лоши входни данни:
es_es: Archivos de entrada malas:
pt_br: Arquivos de entrada ruins:

source: Problem Files
bg_bg: Проблемни Файлове
es_es: Archivos de problemas
pt_br: Arquivos de problemas

source: Ignoring bad input files:
bg_bg: Пренебрегваме лошите входни файлове:
es_es: Ignorando archivos de entrada malos:
pt_br: Ignorando arquivos de entrada ruins:

source: No Files
bg_bg: Няма Файлове
es_es: Sin archivos
pt_br: Sem arquivos

source: No valid files found!
bg_bg: Няма намерени действителни файлове!
es_es: ¡No se encontraron archivos válidos!
pt_br: Nenhum arquivo válido encontrado!

source: Unsupported MimeType
bg_bg: Неизвестен файлов вид
es_es: Mimetipo no compatible
pt_br: Mimetype não suportado

source: Skipping file:
bg_bg: Пропускаме файл:
es_es: Archivo de omisión:
pt_br: Arquivo de pular:

source: Processing
bg_bg: Обработване
es_es: Tratamiento
pt_br: Processamento

source: AsyncWorkerError
bg_bg: АсинхроннаРаботнаГрешка
es_es: Error del trabajador asíncrono
pt_br: Erro de trabalhador assíncrono

source: Duplicate path:
bg_bg: Повторено местоположение:
es_es: Ruta duplicada:
pt_br: Caminho duplicado:

source: Error in Opening
bg_bg: Грешка при отваряне
es_es: Error en la apertura
pt_br: Erro na abertura

source: Cannot detect save file format, defaulting to png.
bg_bg: Не е възможно да се засече формата за записване на файлове, използване по подразбиране png.
es_es: No se puede detectar el formato de archivo Guardar, por defecto a PNG.
pt_br: Não é possível detectar o formato Salvar Arquivo, inadimplente para PNG.

source: is not writeable.
bg_bg: не може да се записва.
es_es: no es escrito.
pt_br: não é escrito.

source: Permissions
bg_bg: Разрешения
es_es: Permisos
pt_br: Permissões

source: is not writeable.
bg_bg: не може да се записва.
es_es: no es escrito.
pt_br: não é escrito.

source: Close
bg_bg: Затвори
es_es: Cerca
pt_br: Fechar

source: Opening File Error
bg_bg: Грешка при отваряне
es_es: Error de archivo de apertura
pt_br: Erro de arquivo de abertura

source: Errors in Processing!
bg_bg: Грешка при отваряне!
es_es: ¡Errores en el procesamiento!
pt_br: Erros no processamento!

source: Unable to open input
bg_bg: Не могат да се отворят данни
es_es: No se puede abrir la entrada
pt_br: Incapaz de abrir a entrada

source: Cannot Open File
bg_bg: Не може да се отвори
es_es: No se puede abrir el archivo
pt_br: Não é possível abrir o arquivo

source: The minimum file duration is 3 seconds.
bg_bg: Най-малката продължителност е 3 секунди.
es_es: La duración mínima del archivo es de 3 segundos.
pt_br: A duração mínima do arquivo é de 3 segundos.

source: File Error
bg_bg: Файлова Грешка
es_es: Error de archivo
pt_br: Erro de arquivo

source: File Information
bg_bg: Файлови Сведения
es_es: Información de archivo
pt_br: Informações do arquivo

source: Go Compare
bg_bg: Направи Съпоставка
es_es: Ve a comparar
pt_br: Vá comparar

source: Save All
bg_bg: Запази Всички
es_es: Guardar todo
pt_br: Salve tudo

source: Preferences
bg_bg: Предпочитания
es_es: Preferencias
pt_br: Preferências

source: Formats
bg_bg: Формати
es_es: Formatos
pt_br: Formatos

source: Keyboard Shortcuts
bg_bg: Клавишни Комбинации
es_es: Atajos de teclado
pt_br: Atalhos de teclado

source: Help
bg_bg: Помощ
es_es: Ayuda
pt_br: Ajuda

source: About
bg_bg: Относно
es_es: Acerca de
pt_br: Sobre

source: Open Files
bg_bg: Отвори Файлове
es_es: Archivos abiertos
pt_br: Arquivos abertos

source: Advanced Open
bg_bg: Разширено Отваряне
es_es: Abierto avanzado
pt_br: Abertura avançada

source: Save
bg_bg: Запази
es_es: Ahorrar
pt_br: Salvar

source: Save Tab
bg_bg: Запази Раздел
es_es: Guardar pestaña
pt_br: Guia Salvar

source: Open Folders
bg_bg: Отвори Папки
es_es: Abre carpetas
pt_br: Pastas abertas

source: Add Files
bg_bg: Добави Файлове
es_es: Agregar archivos
pt_br: Adicionar arquivos

source: Add files for processing
bg_bg: Добави файлове за обработка
es_es: Agregar archivos para procesar
pt_br: Adicionar arquivos para processamento

source: Add Folders
bg_bg: Добави Папки
es_es: Agregar carpetas
pt_br: Adicione pastas

source: Add folders for processing
bg_bg: Фобави папки за обработка
es_es: Agregar carpetas para procesar
pt_br: Adicione pastas para processamento

source: use LUFS units
bg_bg: ползвай LUFS единици
es_es: utilizar unidades LUFS
pt_br: Use unidades LUFS

source: recursive (search sub-folders)
bg_bg: претърси (търси в под-папки)
es_es: recursivo (search sub-pleas)
pt_br: Recursiva (sub-oscilantes de pesquisa)

source: overview mode
bg_bg: прегледен разадел
es_es: modo de descripción general
pt_br: Modo de startwoverview

source: Start
bg_bg: Започни
es_es: Comenzar
pt_br: Começar

source: Begin audio analysis
bg_bg: Започни звуков анализ
es_es: Comenzar el análisis de audio
pt_br: Inicie a análise de áudio

source: Failed Open
bg_bg: Провалено отваряне
es_es: Fracasado abierto
pt_br: Falhou aberto

source: Save in Folder
bg_bg: Запази в Папка
es_es: Guardar en la carpeta
pt_br: Salvar na pasta

source: Save All in Folder
bg_bg: Запази Всички в Папка
es_es: Guardar todo en la carpeta
pt_br: Salve tudo na pasta

source: Cannot Compare
bg_bg: Не може да се сравни
es_es: No se puede comparar
pt_br: Não pode comparar

source: No tabs.
bg_bg: Няма раздели.
es_es: No hay pestañas.
pt_br: Sem guias.

source: Too few tabs.
bg_bg: Твърде малко раздели.
es_es: Muy pocas pestañas.
pt_br: Muito poucas guias.

source: Go!
bg_bg: Действай!
es_es: ¡Ir!
pt_br: Ir!

source: Compare tabs in separate window
bg_bg: Сравни раздели и отделен прозорец
es_es: Compare pestañas en una ventana separada
pt_br: Compare as guias em janela separada

source: ☑ All!
bg_bg: ☑ Всички!
es_es: ☑ ¡Todos!
pt_br: ☑ Todos!

source: Compare ALL tabs in separate window
bg_bg: Сравни ВСИЧКИ раздели в отделен прозорец
es_es: Compare TODAS las pestañas en una ventana separada
pt_br: Compare todas as guias em janela separada

source: Comparison #
bg_bg: Съпоставка #
es_es: Comparación #
pt_br: Comparação #

source: Supported Formats
bg_bg: Поддържани Формати
es_es: Formatos compatibles
pt_br: Formatos suportados

source: Original PyMasVis module development.
bg_bg: Първоначално разработване на пайМасВис модул.
es_es: Desarrollo original del módulo de PyMasVis.
pt_br: Desenvolvimento original do módulo Pymasvis.

source: GTK application, originally based on PyMasVis commit #657196.
bg_bg: ГТК приложение, първоначално основана на ПайМасВис #657196.
es_es: Aplicación GTK, originalmente basada en PyMasVis Commit #657196.
pt_br: Aplicativo GTK, originalmente baseado no commit pymasvis #657196.

source: Input file has no audio stream:
bg_bg: Входният файл няма звукова пътечка:
es_es: El archivo de entrada no tiene transmisión de audio:
pt_br: O arquivo de entrada não tem fluxo de áudio:

source: Crest: {:0.2f} dB, DR: {}, L$_K$: {:0.1f} {}, LRA: {:0.1f} LU, PLR: {:0.1f} LU
bg_bg: Вълнов фактор: {:0.2f} dB, Д.О.: {}, L$_K$: {:0.1f} {}, LRA: {:0.1f} LU, PLR: {:0.1f} LU
es_es: Cresta: {:0.2f} dB, DR: {}, L$_K$: {:0.1f} {}, LRA: {:0.1f} LU, PLR: {:0.1f} LU
pt_br: Crista: {:0.2f} dB, DR: {}, L$_K$: {:0.1f} {}, LRA: {:0.1f} LU, PLR: {:0.1f} LU

source: Encoding: {}, Channels: {}, Layout: {}, Bits: {}, Sample rate: {} Hz, Bitrate: {} kbps, Duration: {}, Size: {:0.1f} MB
bg_bg: Кодек: {}, Канали: {}, Скица: {}, Битове: {}, Дискретизация: {} Хц, Битове/сек: {} кб/сек, Продължителност: {}, Размер: {:0.1f} MB
es_es: Codificación: {}, Canales: {}, Diseño: {}, Bits: {}, Velocidad de muestreo: {} Hz, BitRate: {} kbps, Duración: {}, Tamaño: {:0.1f} mb
pt_br: Codificação: {}, Canais: {}, Layout: {}, Bits: {}, Taxa de amostragem: {} Hz, Taxa de bits: {} kbps, Duração: {}, Tamanho: {:0.1f} MB

source: Album
bg_bg: Албум
es_es: Álbum
pt_br: Álbum

source: Track
bg_bg: Песен
es_es: Pista
pt_br: Pista

source: Date
bg_bg: Година
es_es: Fecha
pt_br: Data

source: Checksum (energy):
bg_bg: Сметка-проверка (енергия):
es_es: Suma de verificación (energía):
pt_br: Checksum (energia)

source: MasVisGtk
bg_bg: МасВисГтк

source: {}: Crest = {:0.2f} dB / RMS = {:0.2f} dBFS / Peak = {:0.2f} dBFS / True Peak ≈ {:0.2f} dBTP
bg_bg: {}: Вълнов фактор = {:0.2f} dB / RMS = {:0.2f} dBFS / Връх = {:0.2f} dBFS / Истински Връх ≈ {:0.2f} dBTP
es_es: {}: Cresta = {:0.2f} dB / RMS = {:0.2f} dBFS / Pico = {:0.2f} dBFS / Pico Verdadero ≈ {:0.2f} dBTP
pt_br: {}: Crest = {:0.2f} dB / RMS = {:0.2f} dBFS / Pico = {:0.2f} dBFS / Pico Máximo ≈ {:0.2f} dBTP

source: Loudest part ({} channel, {} samples > 95{} during 20 ms at {:0.2f} sec)
bg_bg: Най-громката част ({} канал, {} проби > 95{} през 20 мсек при {:0.2f} сек)
es_es: Parte más fuerte ({} canal, {} muestras > 95{} durante 20 ms en {:0.2f} Sec)
pt_br: Parte mais alta ({} direito, {} amostras > 95{} durante 20 ms a {:0.2f} segundo)

source: Normalised average spectrum,
bg_bg: Нормализиран осреднен спектър,
es_es: Espectro promedio normalizado,
pt_br: Espectro médio normalizado,

source: frames
bg_bg: кадър/а
es_es: marcos
pt_br: quadros

source: Allpassed crest factor
bg_bg: Цяломинаващ (crest) фактор
es_es: Factor de cresta de AllPassed
pt_br: Fator de pico de todos os canais

source: Histogram, 'bits':
bg_bg: Хистограма, 'битове':
es_es: Histograma, 'bits':
pt_br: Histograma, 'bits':

source: Peak vs RMS level
bg_bg: Връх срещу RMS
es_es: Nivel pico vs RMS
pt_br: Pico vs nível RMS

source: Short term (1 s) crest factor
bg_bg: Краткосрочен (1 сек) (crest) фактор
es_es: Factor de cresta a corto plazo (1 s)
pt_br: Fator de pico de curto prazo (1 s)

source: EBU R 128 Short term loudness
bg_bg: EBU R 128 краткосрочна гръмкост
es_es: Ebu R 128 Voleza a corto plazo
pt_br: Loudness de curto prazo EBU R 128

source: Short term PLR
bg_bg: Краткосрочен PLR
es_es: PLR a corto plazo
pt_br: Curto prazo PLR

source: Scale to Window Width
bg_bg: Разшири размер до края на прозореца
es_es: Escala al ancho de la ventana
pt_br: Escala para largura da janela

source: Unknown Dynamic Range
bg_bg: Неизвестен Динамичен Обхват
es_es: Rango dinámico desconocido
pt_br: Faixa dinâmica desconhecida

source: Dynamic Range
bg_bg: Динамичен Обхват
es_es: Rango dinámico
pt_br: Faixa dinâmica

source: DR = {} Peak = {:0.1f} dBFS Crest = {:0.1f} dB L$_k$ = {:0.1f} LU
bg_bg: Д.О. = {} Връх = {:0.1f} dBFS Вълнов = {:0.1f} dB L$_k$ = {:0.1f} LU
es_es: DR = {} Pico = {:0.1f} dBFS Cresta = {:0.1f} dB L$_k$ = {:0.1f} LU
pt_br: DR = {} Pico = {:0.1f} dBFS Crest = {:0.1f} dB L$_k$ = {:0.1f} LU
