Repository: itprojects/MasVisGtk
Catalog: po/*.po
Languages: bg_bg, es_es, pt_br

source: Dynamic Range Chart
bg_bg: Диаграма на Динамичния Обхват
es_es: Gráfico de rango dinámico

source: Zoom in
bg_bg: Увеличи
es_es: Ampliar en

source: Restore original dimensions
bg_bg: Възстанови първоначалните размери
es_es: Restaurar dimensiones originales

source: Zoom out
bg_bg: Намали
es_es: Ampliar hacia fuera

source: Dynamic Range of Channels
bg_bg: Динамичен Обхват на Каналите
es_es: A una gama dinámica de canales

source: Channel #
bg_bg: Канал #
es_es: Canal #

source: <i>See the <b>glossary at the end</b> for <b>audio terms</b> and <b>definitions</b>.</i> ## <span size="larger"><b>The Overview Graph</b></span> The overview graph is appropriate for displaying condensed information about an entire album. It shows the waveforms from the left and the right channels superimposed on each other. The left channel is shown in blue, the right in red. Parts where left and right channels overlap are shown in black. If a lot of color is shown, the channels are quite different. The crest factor, and the level of the highest peak, are shown to the right of each graphs. The value can differ from those in the detailed analysis, since the left and right channels are analyzed as one. ## <span size="larger"><b>The detailed analysis graph</b></span> The detailed analysis graph shows a deeper analysis of a single track. Each graph shows a different aspect of the track, as described below. ### <span size="large"><b>Left and Right</b></span> The top graphs show the waveforms of the left and right channels, quite like in the overview graph, but separately. The crest factor, the RMS level, and the peak levels of the channels, appear above the graphs. ### <span size="large"><b>The loudest part</b></span> In order to show how the strongest part of the track has survived the mastering processing, MasVis looks for a strong part of the track, and zooms-in on that. Around the selected part, a window of 100 milliseconds is shown. Clipping and/or brickwall limitation is typically revealed here. The part show is not selectable by the user, in accordance with the idea that the MasVis graphs should appear the same, regardless of who does the analysis. The selection is automatically made, by MasVis, in the following way: 1. Find the highest sample value in the sound file 2. Apply a threshold of 95 % of the highest sample value 3. For every place, that the signal exceeds the threshold, count how many samples exceed the threshold 4. Select the place, where the highest number of samples exceeding the threshold occur The sample count, for the selected part, is displayed above the graph. ### <span size="large"><b>Normalized average sepctrum</b></span> This graph shows the average spectrum of the signal. The graph is made by averaging 1-second Blackman windows of the signal. This graph can be used to identify timbral properties of the signal. The sloping solid lines drop by 6dB/octave and can serve as a reference for judging the spectral content of the track. Even though this graph does not differentiate between mastering processing and the rest of the production, including the instruments, it is very useful, for comparing different releases of the same album. "Remastered" versions of albums often come with various spectral changes, and these are revealed in the spectrum graph quite clearly, when flipping between the two versions. The spectrum graph is normalized, that is, the RMS level of the signal does not affect the graph at all. ### <span size="large"><b>Allpassed crest factor</b></span> Is probably the most revealing graph in MasVis. It gives an estimate of how much the crest factor has been lowered, by the processing of the 2-channel master. In the graph, there are four curves, two red for the right channel, and two blue for the left channel. The dashed line shows the crest factor, i.e. the same information as above the waveform graphs. The solid line shows the crest factor of the signal after it has passed an allpass filter. The second crest factor is a rough, and typically underestimated value of how large the crest factor was prior to level maximation of the 2-channel master. At first, it may seem impossible to make such an estimate, but experience shows that the method works. Of course, it does not give an exact value of the original crest factor, but it is good enough to tell when the track has been subjected to destructive loudness maximation. The difference between the maximum in the solid line, and the dashed line, correlates quite well with the amount of crest factor loss that is a result of level maximation of the 2-channel mix. Here is the method that MasVis uses, to make the graph: 1. Draw a dashed line, at the crest factor of the track 2. Run the track through seven different first order allpass filters at 20, 60, 200, 600, 2000, 6000, and 20000 Hz 3. For each of the seven filtered signals, calculate a new crest factor value 4. Plot a solid line, representing the crest factors of the seven signals, as a funciton of filter frequency ### <span size="large"><b>Histogram</b></span> In 16 bit audio, such as on a CD, the waveform is represented by 16-bit numbers, giving a range of -32768 to +32727 for the sample values. Some values are more common than others. If, for example, the tracks is a completely quiet, that is all sample values are 0, the sample value 0 becomes very common. If there is a weak sound, small sample values become common, and if the signal is extremely loud and clipped, the extreme sample values become common instead. The histogram shows the number of samples for each sample value. A track that contains complete silence will show a peak near 0, and a track that contains clipping will show peaks at the high and/or low ends of the histogram. It can be shown by statistical analysis that the sum of many signals with a reasonably constant amplitude over time, will result in a "normal distribution". Such a distribution takes the shape of a parabola if the y-axis is logarithmic (as in MasVis). If the signals do not have constant amplitudes, but amplitudes that vary over time, the shape becomes more like a pyramid, with approximately linear slopes. However, the histogram of the sum of many uncorrelated signals, never has abrupt endings. Such abrupt endings only occur if the signals are correlated (which they almost never are), or if the 2-channel mix has been tampered. One would expect a histogram with smooth slopes for any mix of several signals, unless the 2-channel mix has been subjected to clipping or brickwall limitation. Thus, the histogram is useful for revealing clipping and limitation. The "bits" number, above the histogram, indicates how many of the 65536 levels, occur at least once in the sound file. If all 65536 sample levels occur in the sound file, the number of bits is shown as 16,0. If only half of them are used, (i.e. 32768), then 15,0 is shown. In mathematical terms, the number that is shown is the 2-logarithm of the number of used sample levels. Somewhat counterintuitive, recordings that have been subjected to mastering processing typically come near to 16,0 "bits", whereas unprocessed recordings at full scale typically reach 14-15 "bits". ### <span size="large"><b>Peak vs. RMS level</b></span> This graph is based on 1 second long frames of the signal, and each is represented by a circle in the diagram. For each frame, the RMS and peak levels also give the crest factor. The crest factor for each frame can also be read from the diagram. This graph is useful for showing the dynamics of the track. If a signal is amplified, the circle moves up towards the right, since both the peak and the RMS increase by the same amount. When the circles reach the top, further RMS increase is only possible if the crest factor is lowered. Too many modern productions are very crowded in the upper right corner. ### <span size="large"><b>Short term crest factor</b></span> Each of the circles in the Peak vs. RMS graph, also appear in the short term crest factor graph. Here, the crest factor of the 1-second windows is displayed against time. It is beneficial to compare this graph with the waveform graphs. For natural, unprocessed sounds, the crest factor typically increases a bit, when the sound is louder. Loud sound is typically associated with a richer spectrum and an increased number of sound sources. Both these factors increase the crest factor. However, if the 2-channel mix has been subjected to clipping or limitation, the crest factor is typically lowered, when the sound becomes loud. ## <span size="larger"><b>Glossary</b></span> ### <span size="large"><b>Crest factor</b></span> The crest factor is the ratio between the peak value and the RMS value during a frame. The crest factor is mostly expressed in decibels [dB], and if so, it is the difference between the peak level [dB] and the RMS level [dB]. The crest factor is never negative. A sinusoid has a crest factor of 3 dB, and a square wave 0 dB. ### <span size="large"><b>Spectrum</b></span> A sepctrum graph is the result of a Fourier transform (FFT), and shows how the energy (in a signal) is distributed across different frequencies. ### <span size="large"><b>Peak and RMS values</b></span> The RMS (root mean square) value is proportional to the average power of a signal seen over some time. The peak value, is the maximum absolute value within that time period. ### <span size="large"><b>Frame</b></span> A frame is a short or long part of the sound signal. In MasVis, 1-second frames are used to generate the spectrum and the short term crest factor graph. ### <span size="large"><b>Allpass filter</b></span> An allpass filter lets all frequencies pass, without attenuation or amplification. However, the phases of different frequencies are shifted differently. The result is a signal that sounds very similar to the original signal, but with a different waveform. ### <span size="large"><b>Checksum</b></span> Checksums are used frequently to ensure the integrity of data file. Checksum algorithms produce results that are quite different, even if only a single bit is changed. The checksum algorithm in MasVis is different, in that it remains the same if silence is added to the file. ### <span size="large"><b>Histogram</b></span> A histogram is a diagram that tells "how many of each there are". For example, a simple histogram may show how many students have passed or failed an exam. This histogram would have only two bars: pass and fail. The histogram in MasVis has 65536 bars internally, each representing one level in the 16 bit PCM format. These bars are presented in the histogram, showing if some sample levels are more common than others.
pt_br: <i>Consulte o <b>glossário no final para</b> termos e <b>definições</b> <b>de áudio</b>.</i> ## <span size="larger"><b>O gráfico de visão geral</b></span> O gráfico de visão geral é apropriado para exibir informações condensadas sobre um álbum inteiro. Ele mostra as formas de onda dos canais esquerdo e direito sobrepostos um ao outro. O canal esquerdo é mostrado em azul, o direito em vermelho. As partes onde os canais esquerdo e direito se sobrepõem são mostradas em preto. Se muita cor for mostrada, os canais são bem diferentes. O fator de crista e o nível do pico mais alto são mostrados à direita de cada gráfico. O valor pode ser diferente daqueles na análise detalhada, uma vez que os canais esquerdo e direito são analisados como um só. ## <span size="larger"><b>O gráfico de análise detalhada</b></span> O gráfico de análise detalhada mostra uma análise mais profunda de uma única faixa. Cada gráfico mostra um aspecto diferente da faixa, conforme descrito abaixo. ### <span size="large"><b>Esquerda e Direita</b></span> Os gráficos superiores mostram as formas de onda dos canais esquerdo e direito, como no gráfico de visão geral, mas separadamente. O fator de crista, o nível RMS e os níveis de pico dos canais aparecem acima dos gráficos. ### <span size="large"><b>A parte mais barulhenta</b></span> Para mostrar como a parte mais forte da faixa sobreviveu ao processamento de masterização, MasVis procura uma parte forte da faixa e amplia isso. Ao redor da parte selecionada, uma janela de 100 milissegundos é mostrada. A limitação de recorte e/ou parede de tijolos é normalmente revelada aqui. A apresentação de peças não é selecionável pelo usuário, de acordo com a ideia de que os gráficos MasVis devem ter a mesma aparência, independentemente de quem faz a análise. A seleção é feita automaticamente, pela MasVis, da seguinte forma: 1. Encontre o valor de amostra mais alto no arquivo de som 2. Aplicar um limiar de 95 % do valor mais elevado da amostra 3. Para cada lugar que o sinal excede o limite, conte quantas amostras excedem o limite 4. Selecione o local onde ocorre o maior número de amostras que excedem o limite A contagem de amostras, para a peça selecionada, é exibida acima do gráfico. ### <span size="large"><b>Segmento médio normalizado</b></span> Este gráfico mostra o espectro médio do sinal. O gráfico é feito pela média de janelas Blackman de 1 segundo do sinal. Este gráfico pode ser usado para identificar propriedades tímbricas do sinal. As linhas sólidas inclinadas caem 6dB / oitava e podem servir como referência para julgar o conteúdo espectral da faixa. Embora este gráfico não diferencie entre o processamento de masterização e o resto da produção, incluindo os instrumentos, é muito útil, para comparar diferentes lançamentos do mesmo álbum. Versões "remasterizadas" de álbuns geralmente vêm com várias mudanças espectrais, e estas são reveladas no gráfico de espectro com bastante clareza, ao alternar entre as duas versões. O gráfico de espectro é normalizado, ou seja, o nível RMS do sinal não afeta o gráfico de forma alguma. ### <span size="large"><b>Fator de crista ultrapassado</b></span> É provavelmente o gráfico mais revelador em MasVis. Ele fornece uma estimativa de quanto o fator de crista foi reduzido, pelo processamento do mestre de 2 canais. No gráfico, há quatro curvas, duas vermelhas para o canal direito e duas azuis para o canal esquerdo. A linha tracejada mostra o fator de crista, ou seja, as mesmas informações acima dos gráficos de forma de onda. A linha sólida mostra o fator de crista do sinal depois de passar por um filtro passa-tudo. O segundo fator de crista é um valor aproximado e normalmente subestimado de quão grande era o fator de crista antes da maximização do nível do mestre de 2 canais. A princípio, pode parecer impossível fazer tal estimativa, mas a experiência mostra que o método funciona. Claro, ele não fornece um valor exato do fator de crista original, mas é bom o suficiente para dizer quando a faixa foi submetida à maximização de volume destrutiva. A diferença entre o máximo na linha sólida e a linha tracejada se correlaciona muito bem com a quantidade de perda do fator de crista que é resultado da maximização do nível da mixagem de 2 canais. Aqui está o método que MasVis usa para fazer o gráfico: 1. Desenhe uma linha tracejada, no fator de crista da faixa 2. Passe a trilha por sete filtros allpass de primeira ordem diferentes em 20, 60, 200, 600, 2000, 6000 e 20000 Hz 3. Para cada um dos sete sinais filtrados, calcule um novo valor de fator de crista 4. Trace uma linha sólida, representando os fatores de crista dos sete sinais, como uma função da frequência do filtro ### <span size="large"><b>Histograma</b></span> Em áudio de 16 bits, como em um CD, a forma de onda é representada por números de 16 bits, dando um intervalo de -32768 a +32727 para os valores de amostra. Alguns valores são mais comuns do que outros. Se, por exemplo, as faixas estiverem completamente silenciosas, ou seja, todos os valores de amostra forem 0, o valor de amostra 0 se tornará muito comum. Se houver um som fraco, pequenos valores de amostra se tornarão comuns, e se o sinal for extremamente alto e cortado, os valores de amostra extremos se tornarão comuns. O histograma mostra o número de amostras para cada valor de amostra. Uma trilha que contém silêncio completo mostrará um pico próximo a 0, e uma trilha que contém recorte mostrará picos nas extremidades alta e/ou baixa do histograma. Pode ser mostrado por análise estatística que a soma de muitos sinais com uma amplitude razoavelmente constante ao longo do tempo, resultará em uma "distribuição normal". Tal distribuição assume a forma de uma parábola se o eixo y for logarítmico (como em MasVis). Se os sinais não tiverem amplitudes constantes, mas amplitudes que variam ao longo do tempo, a forma se torna mais parecida com uma pirâmide, com inclinações aproximadamente lineares. No entanto, o histograma da soma de muitos sinais não correlacionados nunca tem finais abruptos. Essas terminações abruptas só ocorrem se os sinais estiverem correlacionados (o que quase nunca são) ou se a mixagem de 2 canais tiver sido adulterada. Seria de se esperar um histograma com inclinações suaves para qualquer combinação de vários sinais, a menos que a mixagem de 2 canais tenha sido submetida a recorte ou limitação de parede de tijolos. Assim, o histograma é útil para revelar recorte e limitação. O número de "bits", acima do histograma, indica quantos dos níveis 65536 ocorrem pelo menos uma vez no arquivo de som. Se todos os 65536 níveis de amostra ocorrerem no arquivo de som, o número de bits será mostrado como 16,0. Se apenas metade deles for usada (ou seja, 32768), então 15,0 é mostrado. Em termos matemáticos, o número mostrado é o logaritmo 2 do número de níveis de amostra usados. Um tanto contra-intuitivo, as gravações que foram submetidas ao processamento de masterização normalmente chegam perto de 16,0 "bits", enquanto as gravações não processadas em escala real normalmente atingem 14-15 "bits". ### <span size="large"><b>Pico vs. nível RMS</b></span> Este gráfico é útil para mostrar a dinâmica da pista. Se um sinal for amplificado, o círculo se move para a direita, pois tanto o pico quanto o RMS aumentam na mesma quantidade. Quando os círculos atingem o topo, um aumento adicional de RMS só é possível se o fator de crista for reduzido. Muitas produções modernas estão muito lotadas no canto superior direito. ### <span size="large"><b>Fator de crista de curto prazo</b></span> Cada um dos círculos no gráfico Pico vs. RMS também aparece no gráfico de fator de crista de curto prazo. Aqui, o fator de crista das janelas de 1 segundo é exibido em relação ao tempo. É benéfico comparar este gráfico com os gráficos de forma de onda. Para sons naturais e não processados, o fator de crista normalmente aumenta um pouco, quando o som é mais alto. O som alto é normalmente associado a um espectro mais rico e a um número maior de fontes sonoras. Ambos os fatores aumentam o fator de crista. No entanto, se a mixagem de 2 canais tiver sido submetida a corte ou limitação, o fator de crista é normalmente reduzido, quando o som se torna alto. ## <span size="larger"><b>Glossário</b></span> ### <span size="large"><b>Fator de crista</b></span> O fator de crista é a razão entre o valor de pico e o valor RMS durante um quadro. O fator de crista é expresso principalmente em decibéis [dB] e, em caso afirmativo, é a diferença entre o nível de pico [dB] e o nível RMS [dB]. O fator de crista nunca é negativo. Um sinusóide tem um fator de crista de 3 dB e uma onda quadrada de 0 dB. ### <span size="large"><b>Spectrum</b></span> Um gráfico de sepctrum é o resultado de uma transformada de Fourier (FFT) e mostra como a energia (em um sinal) é distribuída em diferentes frequências. ### <span size="large"><b>Valores de pico e RMS</b></span> O valor RMS (raiz quadrada média) é proporcional à potência média de um sinal visto ao longo de algum tempo. O valor de pico é o valor absoluto máximo dentro desse período de tempo. ### <span size="large"><b>Frame</b></span> Um quadro é uma parte curta ou longa do sinal sonoro. No MasVis, os quadros de 1 segundo são usados para gerar o espectro e o gráfico do fator de crista de curto prazo. ### <span size="large"><b>Filtro Allpass</b></span> Um filtro passa-tudo permite que todas as frequências passem, sem atenuação ou amplificação. No entanto, as fases de diferentes frequências são deslocadas de forma diferente. O resultado é um sinal que soa muito semelhante ao sinal original, mas com uma forma de onda diferente. ### <span size="large"><b>Soma de verificação</b></span> As somas de verificação são usadas com frequência para garantir a integridade do arquivo de dados. Os algoritmos de soma de verificação produzem resultados bem diferentes, mesmo que apenas um único bit seja alterado. O algoritmo de soma de verificação no MasVis é diferente, pois permanece o mesmo se o silêncio for adicionado ao arquivo. ### <span size="large"><b>Histograma</b></span> Um histograma é um diagrama que informa "quantos de cada um existem". Por exemplo, um histograma simples pode mostrar quantos alunos foram aprovados ou reprovados em um exame. Este histograma teria apenas duas barras: aprovação e reprovação. O histograma no MasVis tem 65536 barras internamente, cada uma representando um nível no formato PCM de 16 bits. Essas barras são apresentadas no histograma, mostrando se alguns níveis de amostra são mais comuns do que outros.
