Repository: itprojects/MasVisGtk
Catalog: po/*.po
Languages: bg_bg, es_es, pt_br

source: <i>See the <b>glossary at the end</b> for <b>audio terms</b> and <b>definitions</b>.</i> ## <span size="larger"><b>The Overview Graph</b></span> The overview graph is appropriate for displaying condensed information about an entire album. It shows the waveforms from the left and the right channels superimposed on each other. The left channel is shown in blue, the right in red. Parts where left and right channels overlap are shown in black. If a lot of color is shown, the channels are quite different. The crest factor, and the level of the highest peak, are shown to the right of each graphs. The value can differ from those in the detailed analysis, since the left and right channels are analyzed as one. ## <span size="larger"><b>The detailed analysis graph</b></span> The detailed analysis graph shows a deeper analysis of a single track. Each graph shows a different aspect of the track, as described below. ### <span size="large"><b>Left and Right</b></span> The top graphs show the waveforms of the left and right channels, quite like in the overview graph, but separately. The crest factor, the RMS level, and the peak levels of the channels, appear above the graphs. ### <span size="large"><b>The loudest part</b></span> In order to show how the strongest part of the track has survived the mastering processing, MasVis looks for a strong part of the track, and zooms-in on that. Around the selected part, a window of 100 milliseconds is shown. Clipping and/or brickwall limitation is typically revealed here. The part show is not selectable by the user, in accordance with the idea that the MasVis graphs should appear the same, regardless of who does the analysis. The selection is automatically made, by MasVis, in the following way: 1. Find the highest sample value in the sound file 2. Apply a threshold of 95 percent of the highest sample value 3. For every place, that the signal exceeds the threshold, count how many samples exceed the threshold 4. Select the place, where the highest number of samples exceeding the threshold occur The sample count, for the selected part, is displayed above the graph. ### <span size="large"><b>Normalized average sepctrum</b></span> This graph shows the average spectrum of the signal. The graph is made by averaging 1-second Blackman windows of the signal. This graph can be used to identify timbral properties of the signal. The sloping solid lines drop by 6dB/octave and can serve as a reference for judging the spectral content of the track. Even though this graph does not differentiate between mastering processing and the rest of the production, including the instruments, it is very useful, for comparing different releases of the same album. "Remastered" versions of albums often come with various spectral changes, and these are revealed in the spectrum graph quite clearly, when flipping between the two versions. The spectrum graph is normalized, that is, the RMS level of the signal does not affect the graph at all. ### <span size="large"><b>Allpassed crest factor</b></span> Is probably the most revealing graph in MasVis. It gives an estimate of how much the crest factor has been lowered, by the processing of the 2-channel master. In the graph, there are four curves, two red for the right channel, and two blue for the left channel. The dashed line shows the crest factor, i.e. the same information as above the waveform graphs. The solid line shows the crest factor of the signal after it has passed an allpass filter. The second crest factor is a rough, and typically underestimated value of how large the crest factor was prior to level maximation of the 2-channel master. At first, it may seem impossible to make such an estimate, but experience shows that the method works. Of course, it does not give an exact value of the original crest factor, but it is good enough to tell when the track has been subjected to destructive loudness maximation. The difference between the maximum in the solid line, and the dashed line, correlates quite well with the amount of crest factor loss that is a result of level maximation of the 2-channel mix. Here is the method that MasVis uses, to make the graph: 1. Draw a dashed line, at the crest factor of the track 2. Run the track through seven different first order allpass filters at 20, 60, 200, 600, 2000, 6000, and 20000 Hz 3. For each of the seven filtered signals, calculate a new crest factor value 4. Plot a solid line, representing the crest factors of the seven signals, as a funciton of filter frequency ### <span size="large"><b>Histogram</b></span> In 16 bit audio, such as on a CD, the waveform is represented by 16-bit numbers, giving a range of -32768 to +32727 for the sample values. Some values are more common than others. If, for example, the tracks is a completely quiet, that is all sample values are 0, the sample value 0 becomes very common. If there is a weak sound, small sample values become common, and if the signal is extremely loud and clipped, the extreme sample values become common instead. The histogram shows the number of samples for each sample value. A track that contains complete silence will show a peak near 0, and a track that contains clipping will show peaks at the high and/or low ends of the histogram. It can be shown by statistical analysis that the sum of many signals with a reasonably constant amplitude over time, will result in a "normal distribution". Such a distribution takes the shape of a parabola if the y-axis is logarithmic (as in MasVis). If the signals do not have constant amplitudes, but amplitudes that vary over time, the shape becomes more like a pyramid, with approximately linear slopes. However, the histogram of the sum of many uncorrelated signals, never has abrupt endings. Such abrupt endings only occur if the signals are correlated (which they almost never are), or if the 2-channel mix has been tampered. One would expect a histogram with smooth slopes for any mix of several signals, unless the 2-channel mix has been subjected to clipping or brickwall limitation. Thus, the histogram is useful for revealing clipping and limitation. The "bits" number, above the histogram, indicates how many of the 65536 levels, occur at least once in the sound file. If all 65536 sample levels occur in the sound file, the number of bits is shown as 16,0. If only half of them are used, (i.e. 32768), then 15,0 is shown. In mathematical terms, the number that is shown is the 2-logarithm of the number of used sample levels. Somewhat counterintuitive, recordings that have been subjected to mastering processing typically come near to 16,0 "bits", whereas unprocessed recordings at full scale typically reach 14-15 "bits". ### <span size="large"><b>Peak vs. RMS level</b></span> This graph is based on 1 second long frames of the signal, and each is represented by a circle in the diagram. For each frame, the RMS and peak levels also give the crest factor. The crest factor for each frame can also be read from the diagram. This graph is useful for showing the dynamics of the track. If a signal is amplified, the circle moves up towards the right, since both the peak and the RMS increase by the same amount. When the circles reach the top, further RMS increase is only possible if the crest factor is lowered. Too many modern productions are very crowded in the upper right corner. ### <span size="large"><b>Short term crest factor</b></span> Each of the circles in the Peak vs. RMS graph, also appear in the short term crest factor graph. Here, the crest factor of the 1-second windows is displayed against time. It is beneficial to compare this graph with the waveform graphs. For natural, unprocessed sounds, the crest factor typically increases a bit, when the sound is louder. Loud sound is typically associated with a richer spectrum and an increased number of sound sources. Both these factors increase the crest factor. However, if the 2-channel mix has been subjected to clipping or limitation, the crest factor is typically lowered, when the sound becomes loud. ## <span size="larger"><b>Glossary</b></span> ### <span size="large"><b>Crest factor</b></span> The crest factor is the ratio between the peak value and the RMS value during a frame. The crest factor is mostly expressed in decibels [dB], and if so, it is the difference between the peak level [dB] and the RMS level [dB]. The crest factor is never negative. A sinusoid has a crest factor of 3 dB, and a square wave 0 dB. ### <span size="large"><b>Spectrum</b></span> A sepctrum graph is the result of a Fourier transform (FFT), and shows how the energy (in a signal) is distributed across different frequencies. ### <span size="large"><b>Peak and RMS values</b></span> The RMS (root mean square) value is proportional to the average power of a signal seen over some time. The peak value, is the maximum absolute value within that time period. ### <span size="large"><b>Frame</b></span> A frame is a short or long part of the sound signal. In MasVis, 1-second frames are used to generate the spectrum and the short term crest factor graph. ### <span size="large"><b>Allpass filter</b></span> An allpass filter lets all frequencies pass, without attenuation or amplification. However, the phases of different frequencies are shifted differently. The result is a signal that sounds very similar to the original signal, but with a different waveform. ### <span size="large"><b>Checksum</b></span> Checksums are used frequently to ensure the integrity of data file. Checksum algorithms produce results that are quite different, even if only a single bit is changed. The checksum algorithm in MasVis is different, in that it remains the same if silence is added to the file. ### <span size="large"><b>Histogram</b></span> A histogram is a diagram that tells "how many of each there are". For example, a simple histogram may show how many students have passed or failed an exam. This histogram would have only two bars: pass and fail. The histogram in MasVis has 65536 bars internally, each representing one level in the 16 bit PCM format. These bars are presented in the histogram, showing if some sample levels are more common than others.
bg_bg: <i>Вижте <b>речника в края</b> за <b>звуковите определения</b>.</i> ## <span size="larger"><b>Прегледният Раздел</b></span> Прегледният раздел е подходящ за показване на сгъстени сведения относно цял албум. Там се показва вълната на левия и денсия канал, насложени един върху друг. Левият канал е син, десният е червен. Частите, които се припокриват, са черни. Ако снимката е многоцветна, каналите са много различни. Гребенният (crest) фактор, и нивото на най-високият връх, се показват отдясно на всяко изображение. Стойностите могат да имат разлики от подробния преглед, защото левият и десният канал се обработват заедно. ## <span size="larger"><b>Разделът с Подробен Преглед</b></span> Разделът с Подробен Преглед показва по-дълбоко обработване, за единичен звуков файл. Всяко изобразжение показва различно изложение на звука, както е описано по-долу. ### <span size="large"><b>Ляв и Десен (канал)</b></span> Най-горните изображения показват вълните от левия и десния канал, подобно на прегледния раздел, но по-отделно. Гребенният (crest) фактор, средното (RMS) ниво, и стойността на върха, се показват над изображението. ### <span size="large"><b>Най-громката част</b></span> За да покажем как най-громката част от пътечката е преживяла овладяването на обработката, МасВис търси най-силно звучащата част на пътечката, и се вглежда в нея. Около подбраната част, приложението показва прозорец от 100 милисекунди. Подрязване и/или ограничаване (brickwalling) е типично видимо в това изображение. Частта, която се показава не е избираема от потребителя, в съответствие с идеята, че в МасВис изображенията трябва да изглеждат същите, независимо от това, кой прави обработката. Подборът се прави самостойно, от МасВис, по следния начин: 1. Намира се стойността на най-високата проба 2. Прилага се праг от 95 процента от стойността на най-високата проба 3. За всяко място, което сигналът е над прага, се проверява колко проби надвишават прага 4. Подбира се мястото, където се намират най-високият брой на проби превишаващи прага Броят на пробите, за подбраните части, се показва над изображението. ### <span size="large"><b>Нормализиран Осреднен Спектър</b></span> Това изображение показва осредненият спектър на сигнала. То се прави чрез осредняване на 1-секундовите Блакманови прозорци на сигнала. Наклонените линии спадат с 6дБ/октава и могат да служат при съпоставка за отсъждане на спектралното съдържание на пътечката. Въпреки, че това изображение не различава между овладяването на обработката и другите части на производството на музика, включая инструменти, все пак е много полезно, за сравнение на различните версии на същия албум. "Ремастърд" версиите на албумите често идват с множество спектрални (честотни) промени, и тези се виждат доста добре в спектралното изображение, при съпоставка. Спектралното изображение е нормализирано, тоест, че средното (RMS) ниво на сигнала въобще не влияе на изображението. ### <span size="large"><b>Цяломинаващ (crest) фактор</b></span> Най-показателното изображение на МасВис. То дава преценка на това колко от гребенния (crest) фактор е занижен от обработката на 2-каналния (смесен) звуков първообраз. На чертежа има четири криви, две червени за десния канал, и две сини за левия канал. Прекъснатата линия показва гребенния (crest) фактор на сигнала, след като е обработена с филтъра на цялониващия (crest) фактор. Вторият гребенен (crest) фактор е груба, и типично подценена стойност, за това колко голям е бил гребенния (crest) фактор, преди увеличаването на нивото. На пръв поглед може да изглежда, че такава преценка е невъзможна, но опитът показва, че прийомът работи. Разбира се, не дава точна стойност за първоначалния гребенен (crest) фактор, но е достатъчен, за да се каже дали пътечката е подложена на унищожително (честотно) увеличаване на громкостта. Разликата, между максимума в продължителната линия, и прекъснатата линия, се съпоставя доста добре с количеството загуба в гребенния (crest) фактор, до която е довело увеличаването на громкостта на 2-канално смесената пътечка. Ето прийомът, който МасВис използва, за да направи изображението: 1. Начертава прекъсната линия, при гребенния (crest) фактор на пътечката 2. Пуска пътечката през няколко различни първо-разрядни цяломинаващи филтъра при 20, 60, 200, 600, 2000, 6000, и 20000 Хц 3. За всеки от седемте филтрирани сигнала, смята стойността за нов гребенен (crest) фактор 4. Начертава продължителна линия, представляваща гребенния (crest) фактор като функция на филтъровата честота. ### <span size="large"><b>Хистограма</b></span> В 16 битов звук, както е при CD, вълната се представлява от 16-битови числа, давайки обхват от -32768 до +32727 за стойностите на пробите. Някои стойности са по-често срещани от други. Ако, за пример, пътечката е изцяло тиха, всички стойности са 0, 0-ата стойност на пробата е много често срещана. Ако има слаб звук, ниските стойности стават често срещани, а ако сигналът е крайно-громък и подрязан, тогава крайните стойности стават често срещани. Хистограмата показва числото на пробите за всяка стойност. Пътечката, която съдържа пълна тишина, ще покаже връх близо до 0, а пътечка, която подрязва, ще покаже върхове при високите и ниските краища на хистограмата. Може да се покаже, че сбора на множество сигнали с приблизително постоянна амплитуда във времето, ще доведе до "нормалното разпределение". Таково разпределение приема вид на парабола, ако отвесната ос е логаритмична (както е при МасВис). Ако сигналите нямат постоянна амплитуда, а имат такава, която се променя във времето, тогава разпределението става на пирамида, с приблизително праволинейни склонове. Обаче, хистограмата на сбора, на множество несвързани сигнали, не може да има внезапни краища. Такива само стават, ако сигналите са свързани (но те почти никога не са), или, ако 2-каналната смесена пътечка е била подправена (усилвана). Очаква се хистограма с гладки склонове, за всяко смесване на няколко сигнала, освен ако 2-каналната смесена пътечка е подложена на подрязване или ограничаване (brickwalling). Числото "битове", над хистограмата, посочва колко, от 65536-те нива, се появяват поне веднъж във звуковия файл. Ако всички 65536 нива, се показват в звуковия файл, тогава числото се показва като 16,0. Ако само половината са използвани, (пр. 32768), тогава се показва 15,0. В математически смисъл, показаното число е 2-и логаритъм на числото на ползваните пробни нива. До някъде е безсмислено. Записи, които са били овладявани след смесване, типично стигат до 16,0 "битове", докато неовладявани записи на пълен обхват са по-скоро 14-15 "битове". ### <span size="large"><b>Връх срещу RMS</b></span> Това изображение е основано на 1-секундни кадри от сигнала, и всеки е представен като кръгче на чертежа. За всеки кадър, средната (RMS) и върховната стойност дават гребенния (crest) фактор. Гребенният (crest) фактор за всеки кадър може да се прочете от чертежа. Изображението е полезно за показване на динамиката на пътечката. Ако някой сигнал е усилван, кръгчето мърда надясно, понеже и върховата, и средната стойност се повишават със същото количество. Когато кръгчето стигне до горния ъгъл, по-нататъчното увеличаване на средните (RMS) стойности е само въсможно, ако гребенния (crest) фактор е понижен. Твърде много съвременни произведения са много претъпкани в горния десен край. ### <span size="large"><b>Краткосрочен гребенен (crest) фактор</b></span> Всеки един от кръгчетата във Връх срещу RMS изображението, също се появат и в Краткосрочения чертеж. Тук, гребенния (crest) фактор от 1-секундовия прозорец е показан във времето. Добре е да се съпостави със вида на вълните (по-горе). За естествени, необработени звуци, гребенния (crest) фактор нараства малко, когато квука е по-громък. Громкият звук е типично свързан с по-богат спектър и по-голям брой звукови източници. И двете повишават гребенния (crest) фактор. Обаче, ако 2-каналната смесица е била подложена на подрязване или ограничаване (brickwalling), тогава гребенния (crest) фактор е понижен, когато звука е бил увеличен (по-громък). ## <span size="larger"><b>Речник</b></span> ### <span size="large"><b>Гребенен (crest) фактор</b></span> Гребенният (crest) фактор е отношението между стойноста на върха и средната (RMS) стойност, за един кадър. Изявява се в децибели [дБ], и ако е така, това е разликата между стойноста на върха [дБ], и средната стойност (RMS) [дБ]. Гребенният (crest) фактор не може да бъде с отрицателна стойност. Синусоида има гребенен (crest) фактор 3 дБ, и квадратна вълна 0 дБ. ### <span size="large"><b>Спектър</b></span> Спектралното изображение е в следствие на преобразуване на Фурие (FFT), и показва как енергията (в сигнал) е разпределена през различните честоти. ### <span size="large"><b>Връх срещу RMS</b></span> Средната стойност (RMS, root mean square) е пропорционална на средната мощност на един сиганл, видима през определено време. Върховата стойност, е най-голямата стойност, през определено време. ### <span size="large"><b>Кадър</b></span> Кадърът е част от сигнала. В МасВис, 1-секундови кадри се ползват за създаване на спектралното изображение и това на гребенния (crest) фактор. ### <span size="large"><b>Цяломинаващ филтър</b></span> Цяломинаващият филтър позволява на всички честоти да минат, без отслабване или усилване. Обаче, фазите на различните честоти се отместват различно. В следствие, сигналът е подобен на първоначалния, но с различно изглеждаща вълна. ### <span size="large"><b>Сметка-проверка</b></span> Сметките-проверки се ползват чест, за да се осигури цялостта на данните. Сметковите прийоми произвеждат различно, ако дори един бит е сменен. Сметковия прийом на МасВис е различен в това, че не се променя сметката, ако е добавена тишина. ### <span size="large"><b>Хистограма</b></span> Хистограмата е изображение, което казва "колко има от всеки един вид стойности". За пример, проста хистограма може да покаже колко ученика са минали или провалили изпита. Тази хистограма би имала само два стълба: успех и провал. Хистограмата в МасВис има 65536 стълба вътрешно, всеки представящ едно ниво в 16 битов (PCM) формат. Тези стълбове са представени и хистограмата, показващи дали някои са по-често срещани.
es_es: <i>Consulte el <b>glosario al final</b> para ver los <b>términos de audio</b> y las <b>definiciones</b>.</i> ## <span size="larger"><b>El gráfico de descripción general</b></span> El gráfico de descripción general es adecuado para mostrar información condensada sobre un álbum completo. Muestra las formas de onda de los canales izquierdo y derecho superpuestas entre sí. El canal izquierdo se muestra en azul y el derecho en rojo. Las partes en las que se superponen los canales izquierdo y derecho se muestran en negro. Si se muestra mucho color, los canales son bastante diferentes. El factor de cresta y el nivel del pico más alto se muestran a la derecha de cada gráfico. El valor puede diferir de los del análisis detallado, ya que los canales izquierdo y derecho se analizan como uno solo. ## <span size="larger"><b>El gráfico de análisis detallado</b></span> El gráfico de análisis detallado muestra un análisis más profundo de una sola pista. Cada gráfico muestra un aspecto diferente de la pista, como se describe a continuación. ### <span size="large"><b>Izquierdo y derecho</b></span> Los gráficos superiores muestran las formas de onda de los canales izquierdo y derecho, de forma muy similar al gráfico de descripción general, pero por separado. El factor de cresta, el nivel RMS y los niveles de pico de los canales aparecen sobre los gráficos. ### <span size="large"><b>La parte más fuerte</b></span> Para mostrar cómo la parte más fuerte de la pista ha sobrevivido al procesamiento de masterización, MasVis busca una parte fuerte de la pista y la amplía. Alrededor de la parte seleccionada, se muestra una ventana de 100 milisegundos. Aquí se revelan típicamente las limitaciones de recorte y/o de pared de ladrillo. La parte que se muestra no es seleccionable por el usuario, de acuerdo con la idea de que los gráficos de MasVis deben aparecer iguales, independientemente de quién haga el análisis. La selección se realiza automáticamente, por MasVis, de la siguiente manera: 1. Busque el valor de muestra más alto en el archivo de sonido 2. Aplique un umbral del 95 por ciento del valor de muestra más alto 3. Para cada lugar en el que la señal supere el umbral, cuente cuántas muestras superan el umbral 4. Seleccione el lugar en el que se produce la mayor cantidad de muestras que superan el umbral El recuento de muestras, para la parte seleccionada, se muestra sobre el gráfico. ### <span size="large"><b>Septerum promedio normalizado</b></span> Este gráfico muestra el espectro promedio de la señal. El gráfico se crea promediando ventanas de Blackman de 1 segundo de la señal. Este gráfico se puede utilizar para identificar las propiedades tímbricas de la señal. Las líneas sólidas inclinadas caen 6 dB/octava y pueden servir como referencia para juzgar el contenido espectral de la pista. Aunque este gráfico no diferencia entre el procesamiento de masterización y el resto de la producción, incluidos los instrumentos, es muy útil para comparar diferentes lanzamientos del mismo álbum. Las versiones "remasterizadas" de los álbumes a menudo vienen con varios cambios espectrales, y estos se revelan en el gráfico de espectro con bastante claridad, al cambiar entre las dos versiones. El gráfico de espectro está normalizado, es decir, el nivel RMS de la señal no afecta al gráfico en absoluto. ### <span size="large"><b>Factor de cresta de paso total</b></span> Es probablemente el gráfico más revelador de MasVis. Da una estimación de cuánto se ha reducido el factor de cresta, mediante el procesamiento del master de 2 canales. En el gráfico, hay cuatro curvas, dos rojas para el canal derecho y dos azules para el canal izquierdo. La línea discontinua muestra el factor de cresta, es decir, la misma información que los gráficos de forma de onda anteriores. La línea continua muestra el factor de cresta de la señal después de haber pasado un filtro de paso total. El segundo factor de cresta es un valor aproximado y generalmente subestimado de cuán grande era el factor de cresta antes de la maximización del nivel de la mezcla maestra de 2 canales. Al principio, puede parecer imposible hacer una estimación de este tipo, pero la experiencia demuestra que el método funciona. Por supuesto, no da un valor exacto del factor de cresta original, pero es lo suficientemente bueno para determinar cuándo la pista ha sido sometida a una maximización destructiva de la sonoridad. La diferencia entre el máximo en la línea continua y la línea discontinua se correlaciona bastante bien con la cantidad de pérdida del factor de cresta que es resultado de la maximización del nivel de la mezcla de 2 canales. Este es el método que utiliza MasVis para hacer el gráfico: 1. Dibuje una línea discontinua en el factor de cresta de la pista 2. Haga pasar la pista por siete filtros de paso total de primer orden diferentes a 20, 60, 200, 600, 2000, 6000 y 20000 Hz 3. Para cada una de las siete señales filtradas, calcule un nuevo valor de factor de cresta 4. Dibuje una línea continua que represente los factores de cresta de las siete señales en función de la frecuencia del filtro ### <span size="large"><b>Histograma</b></span> En audio de 16 bits, como en un CD, la forma de onda se representa con números de 16 bits, lo que da un rango de -32768 a +32727 para los valores de muestra. Algunos valores son más comunes que otros. Si, por ejemplo, la pista está completamente en silencio, es decir, todos los valores de muestra son 0, el valor de muestra 0 se vuelve muy común. Si hay un sonido débil, los valores de muestra pequeños se vuelven comunes y si la señal es e xtremadamente alto y recortado, los valores de muestra extremos se vuelven comunes en su lugar. El histograma muestra la cantidad de muestras para cada valor de muestra. Una pista que contiene silencio completo mostrará un pico cerca de 0, y una pista que contiene recorte mostrará picos en los extremos alto y/o bajo del histograma. Se puede demostrar mediante análisis estadístico que la suma de muchas señales con una amplitud razonablemente constante a lo largo del tiempo dará como resultado una "distribución normal". Dicha distribución toma la forma de una parábola si el eje y es logarítmico (como en MasVis). Si las señales no tienen amplitudes constantes, sino amplitudes que varían a lo largo del tiempo, la forma se vuelve más parecida a una pirámide, con pendientes aproximadamente lineales. Sin embargo, el histograma de la suma de muchas señales no correlacionadas nunca tiene finales abruptos. Tales finales abruptos solo ocurren si las señales están correlacionadas (que casi nunca lo están) o si se ha alterado la mezcla de 2 canales. Se esperaría un histograma con pendientes suaves para cualquier mezcla de varias señales, a menos que la mezcla de 2 canales haya sido sometida a recortes o limitaciones de tipo brickwall. Por lo tanto, el histograma es útil para revelar recortes y limitaciones. El número de "bits", sobre el histograma, indica cuántos de los 65536 niveles aparecen al menos una vez en el archivo de sonido. Si los 65536 niveles de muestra aparecen en el archivo de sonido, el número de bits se muestra como 16,0. Si solo se utiliza la mitad de ellos (es decir, 32768), se muestra 15,0. En términos matemáticos, el número que se muestra es el logaritmo bidimensional del número de niveles de muestra utilizados. Aunque parezca un tanto contraintuitivo, las grabaciones que han sido sometidas a un proceso de masterización suelen rondar los 16,0 "bits", mientras que las grabaciones sin procesar a escala completa suelen alcanzar los 14-15 "bits". ### <span size="large"><b>Nivel pico vs. RMS</b></span> Este gráfico se basa en fotogramas de 1 segundo de la señal, y cada uno está representado por un círculo en el diagrama. Para cada fotograma, los niveles RMS y pico también dan el factor de cresta. El factor de cresta para cada fotograma también se puede leer en el diagrama. Este gráfico es útil para mostrar la dinámica de la pista. Si se amplifica una señal, el círculo se mueve hacia arriba, hacia la derecha, ya que tanto el pico como el RMS aumentan en la misma cantidad. Cuando los círculos llegan a la parte superior, solo es posible un mayor aumento de RMS si se reduce el factor de cresta. Demasiadas producciones modernas están muy abarrotadas en la esquina superior derecha. ### <span size="large"><b>Factor de cresta a corto plazo</b></span> Cada uno de los círculos en el gráfico de pico vs. RMS también aparece en el gráfico de factor de cresta a corto plazo. Aquí, el factor de cresta de las ventanas de 1 segundo se muestra en función del tiempo. Es útil comparar este gráfico con los gráficos de forma de onda. Para sonidos naturales, sin procesar, el factor de cresta generalmente aumenta un poco cuando el sonido es más fuerte. El sonido fuerte generalmente se asocia con un espectro más rico y una mayor cantidad de fuentes de sonido. Ambos factores aumentan el factor de cresta. Sin embargo, si la mezcla de 2 canales ha sido sometida a recortes o limitaciones, el factor de cresta generalmente se reduce cuando el sonido se vuelve fuerte. ## <span size="larger"><b>Glosario</b></span> ### <span size="large"><b>Factor de cresta</b></span> El factor de cresta es la relación entre el valor pico y el valor RMS durante un cuadro. El factor de cresta se expresa principalmente en decibeles [dB] y, de ser así, es la diferencia entre el nivel pico [dB] y el nivel RMS [dB]. El factor de cresta nunca es negativo. Una onda sinusoidal tiene un factor de cresta de 3 dB y una onda cuadrada de 0 dB. ### <span size="large"><b>Espectro</b></span> Un gráfico de septo es el resultado de una transformada de Fourier (FFT) y muestra cómo se distribuye la energía (en una señal) a través de diferentes frecuencias. ### <span size="large"><b>Valores de pico y RMS</b></span> El valor RMS (raíz cuadrada media) es proporcional a la potencia promedio de una señal observada durante un tiempo. El valor de pico es el valor absoluto máximo dentro de ese período de tiempo. ### <span size="large"><b>Cuadro</b></span> Un cuadro es una parte corta o larga de la señal de sonido. En MasVis, se utilizan cuadros de 1 segundo para generar el espectro y el gráfico de factor de cresta de corto plazo. ### <span size="large"><b>Filtro pasa todo</b></span> Un filtro pasa todo deja pasar todas las frecuencias, sin atenuación ni amplificación. Sin embargo, las fases de las diferentes frecuencias se desplazan de forma diferente. El resultado es una señal que suena muy similar a la señal original, pero con una forma de onda diferente. ### <span size="large"><b>Suma de comprobación</b></span> Las sumas de comprobación se utilizan con frecuencia para garantizar la integridad de los archivos de datos. Los algoritmos de suma de comprobación producen resultados que son bastante diferentes, incluso si solo se cambia un bit. El algoritmo de suma de comprobación en MasVis es diferente, ya que permanece igual si se agrega silencio al archivo. ### <span size="large"><b>Histograma</b></span> Un histograma es un diagrama que indica "cuántos de cada uno hay". Por ejemplo, un histograma simple puede mostrar cuántos estudiantes aprobaron o reprobaron un examen. Este histograma es un diagrama que indica "cuántos de cada uno hay". El histograma tendría solo dos barras: pasa y falla. El histograma en MasVis tiene 65536 barras internamente, cada una representando un nivel en el formato PCM de 16 bits. Estas barras se presentan en el histograma, mostrando si algunos niveles de muestra son más comunes que otros.
